Revit 2027 API
DimensionEqualityLabelFormatting.GetFormatOptions Method
 Gets the format options used to show the parameter value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FormatOptions GetFormatOptions()
Public Function GetFormatOptions As FormatOptions
public:
FormatOptions^ GetFormatOptions()
member GetFormatOptions : unit -> FormatOptions
Return Value
FormatOptions
 A copy of the format options.
See Also
Reference
DimensionEqualityLabelFormatting Class
Autodesk.Revit.DB Namespace